# vstDrawCoordLineN

## Description
```pascal
PROCEDURE vstDrawCoordLineN(
				pt1X       : REAL;
				pt1Y       : REAL;
				pt2X       : REAL;
				pt2Y       : REAL;
				planeRefID : LONGINT);
```

```python

def vs.vstDrawCoordLineN(pt1X, pt1Y, pt2X, pt2Y, planeRefID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt1X|REAL||
|pt1Y|REAL||
|pt2X|REAL||
|pt2Y|REAL||
|planeRefID|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events